<?php
return [
    'category' => [
        // 국내도서
        'KOR' => [
            'name' => '국내도서',
            'child' => [
                '01' => [
                    'name' => '소설',
                    'child' => [
                        '0101' => [
                            'name' => '한국소설',
                            'child' => [
                                '010101' => ['name' => '한국소설일반'],
                                '010102' => ['name' => '고전소설/문학선'],
                                '010103' => ['name' => '공포/호러소설'],
                                '010104' => ['name' => '미스터리/스틸러소설'],
                                '010105' => ['name' => '역사/대하소설'],
                                '010106' => ['name' => '라이트노벨'],
                                '010107' => ['name' => 'SF/과학소설'],
                                '010108' => ['name' => '판타지소설'],
                                '010111' => ['name' => '로맨스소설'],
                                '010113' => ['name' => '무협소설'],
                                '010115' => ['name' => '청소년소설'],
                                '010123' => ['name' => '웹소설'],
                                '010125' => ['name' => '드라마/영화소설'],
                            ]
                        ],
                        '0103' => [
                            'name' => '영미소설',
                            'child' => [
                                '010301' => ['name' => '영미소설일반'],
                                '010303' => ['name' => '고전소설/문학선'],
                                '010305' => ['name' => '역사소설'],
                                '010307' => ['name' => 'SF/과학소설'],
                                '010309' => ['name' => '판타지소설'],
                                '010311' => ['name' => '공포/호러소설'],
                                '010312' => ['name' => '미스터리/스릴러소설'],
                                '010316' => ['name' => '로맨스소설'],
                                '010317' => ['name' => '청소년소설'],
                                '010325' => ['name' => '드라마/영화소설'],
                            ]
                        ],
                        '0105' => [
                            'name' => '일본소설',
                            'child' => [
                                '010501' => ['name' => '일본소설일반'],
                                '010502' => ['name' => '고전소설/문학선'],
                                '010503' => ['name' => '역사소설'],
                                '010504' => ['name' => '공포/호러소설'],
                                '010505' => ['name' => 'SF/과학소설'],
                                '010506' => ['name' => '판타지소설'],
                                '010508' => ['name' => '라이트노벨'],
                                '010509' => ['name' => '로맨스소설'],
                                '010510' => ['name' => '미스터리/스릴러소설'],
                                '010511' => ['name' => '청소년소설'],
                                '010517' => ['name' => '드라마/영화소설'],
                            ]
                        ],
                        '0107' => [
                            'name' => '중국소설',
                            'child' => [
                                '010701' => ['name' => '중국소설일반'],
                                '010702' => ['name' => '고전소설/문학선'],
                                '010703' => ['name' => '역사소설'],
                                '010704' => ['name' => '공포/호러소설'],
                                '010705' => ['name' => '로맨스소설'],
                                '010706' => ['name' => 'SF/과학소설'],
                                '010708' => ['name' => '무협소설'],
                                '010709' => ['name' => '판타지소설'],
                                '010712' => ['name' => '드라마/영화소설'],
                                '010714' => ['name' => '청소년소설'],
                                '010715' => ['name' => '미스터리/스릴러소설'],
                            ]
                        ],
                        '0109' => [
                            'name' => '러시아소설',
                            'child' => [
                                '010901' => ['name' => '러시아소설일반'],
                                '010903' => ['name' => '고전소설/문학선'],
                            ]
                        ],
                        '0111' => [
                            'name' => '프랑스소설',
                            'child' => [
                                '011101' => ['name' => '프랑스소설일반'],
                                '011102' => ['name' => '고전소설/문학선'],
                                '011103' => ['name' => '역사소설'],
                                '011105' => ['name' => 'SF/과학소설'],
                                '011107' => ['name' => '판타지소설'],
                                '011109' => ['name' => '공포/호러소설'],
                                '011110' => ['name' => '미스터리/스릴러소설'],
                                '011111' => ['name' => '로맨스소설'],
                                '011113' => ['name' => '청소년소설'],
                                '011119' => ['name' => '드라마/영화소설'],
                            ]
                        ],
                        '0112' => [
                            'name' => '독일소설',
                            'child' => [
                                '011201' => ['name' => '독일소설일반'],
                                '011202' => ['name' => '고전소설/문학선'],
                                '011203' => ['name' => '역사소설'],
                                '011205' => ['name' => 'SF/과학소설'],
                                '011207' => ['name' => '판타지소설'],
                                '011209' => ['name' => '공포/호러소설'],
                                '011210' => ['name' => '미스터리/스릴러소설'],
                                '011211' => ['name' => '로맨스소설'],
                                '011213' => ['name' => '청소년소설'],
                                '011219' => ['name' => '드라마/영화소설'],
                            ]
                        ],
                        '0115' => [
                            'name' => '북유럽소설',
                            'child' => [
                                '011501' => ['name' => '북유럽소설일반'],
                                '011503' => ['name' => '고전소설/문학선'],
                                '011505' => ['name' => '공포/호러소설'],
                                '011507' => ['name' => '미스터리/스릴러소설'],
                            ]
                        ],
                        '0116' => [
                            'name' => '그외유럽소설',
                            'child' => [
                                '011601' => ['name' => '이탈리아소설'],
                                '011603' => ['name' => '스페인소설'],
                                '011605' => ['name' => '그외유럽소설'],
                            ]
                        ],
                        '0117' => [
                            'name' => '기타나라소설',
                            'child' => [
                                '011701' => ['name' => '중남미소설'],
                                '011703' => ['name' => '아프리카소설'],
                                '011705' => ['name' => '기타나라소설'],
                                '011707' => ['name' => '여러나라소설'],
                            ]
                        ],
                        '0121' => [
                            'name' => '프랑스소설',
                            'child' => [
                                '012102' => ['name' => '한국고전소설/문학선'],
                                '012104' => ['name' => '중국고전소설/문학선'],
                                '012106' => ['name' => '일본고전소설/문학선'],
                                '012108' => ['name' => '영미고전소설/문학선'],
                                '012110' => ['name' => '프랑스고전소설/문학선'],
                                '012112' => ['name' => '독일고전소설/문학선'],
                                '012114' => ['name' => '러시아고전소설/문학선'],
                                '012116' => ['name' => '북유럽고전소설/문학선'],
                                '012118' => ['name' => '고전소설/문학선일반'],
                            ]
                        ],
                        '0124' => [
                            'name' => '세계문학전집',
                            'child' => [
                                '012401' => ['name' => '민음사 세계문학전집'],
                                '012403' => ['name' => '열린책들 세계문학'],
                                '012405' => ['name' => '문학동네 세계문학전집'],
                                '012407' => ['name' => '펭귄 클래식'],
                                '012409' => ['name' => '을유 세계문학전집'],
                                '012411' => ['name' => '문예 세계문학선'],
                                '012413' => ['name' => '창비 세계문학'],
                                '012415' => ['name' => '대산 세계문학총서'],
                                '012417' => ['name' => '시공사 세계문학의 숲'],
                                '012419' => ['name' => '현대문학 세계문학 단편선'],
                                '012421' => ['name' => '민음사 모던 클래식'],
                                '012423' => ['name' => '비채 모던 & 클래식'],
                                '012425' => ['name' => '부 클래식'],
                                '012431' => ['name' => '범우문고'],
                                '012427' => ['name' => '동서문화사 세계문학전집'],
                            ]
                        ],
                        '0126' => [
                            'name' => '라이트노벨',
                            'child' => [
                                '012601' => ['name' => '한국라이트노벨'],
                                '012603' => ['name' => '일본라이트노벨'],
                            ]
                        ],
                        '0128' => [
                            'name' => '장르소설',
                            'child' => [
                                '012801' => ['name' => 'SF/과학소설'],
                                '012803' => ['name' => '판타지소설'],
                                '012805' => ['name' => '공포/호러소설'],
                                '012807' => ['name' => '미스터리/스릴러소설'],
                                '012809' => ['name' => '역사소설'],
                                '012811' => ['name' => '로맨스소설'],
                                '012813' => ['name' => '무협소설'],
                                '012815' => ['name' => '게임소설'],
                                '012817' => ['name' => '웹소설'],
                                '012819' => ['name' => '드라마/영화소설'],
                            ]
                        ],
                    ]
                ],
                '03' => [
                    'name' => '시/에세이',
                    'child' => [
                        '0301' => [
                            'name' => '한국시/에세이',
                            'child' => [
                                '030101' => ['name' => '한국시'],
                                '030103' => ['name' => '명시모음'],
                                '030105' => ['name' => '시조/한시(고전)'],
                                '030107' => ['name' => '현대시조'],
                            ]
                        ],
                        '0302' => [
                            'name' => '해외시',
                            'child' => [
                                '030201' => ['name' => '영미시'],
                                '030203' => ['name' => '일본시'],
                                '030205' => ['name' => '중국시'],
                                '030207' => ['name' => '독일시'],
                                '030209' => ['name' => '프랑스시'],
                                '030211' => ['name' => '기타나라/여러나라시'],
                            ]
                        ],
                        '0304' => [
                            'name' => '테마에세이',
                            'child' => [
                                '030401' => ['name' => '포토에세이'],
                                '030403' => ['name' => '그림에세이'],
                                '030405' => ['name' => '사랑/연애에세이'],
                                '030407' => ['name' => '명상/치유에세이'],
                                '030409' => ['name' => '노년에세이'],
                                '030411' => ['name' => '동물등장에세이'],
                                '030413' => ['name' => '캐릭터에세이'],
                                '030415' => ['name' => '일기/편지'],
                                '030417' => ['name' => '명언/지혜'],
                            ]
                        ],
                        '0307' => [
                            'name' => '나라별에세이',
                            'child' => [
                                '030701' => ['name' => '한국에세이'],
                                '030703' => ['name' => '영미에세이'],
                                '030705' => ['name' => '일본에세이'],
                                '030707' => ['name' => '중국에세이'],
                                '030709' => ['name' => '독일에세이'],
                                '030711' => ['name' => '프랑스에세이'],
                                '030713' => ['name' => '기타국가에세이'],
                            ]
                        ],
                        '0311' => [
                            'name' => '인물자전적에세이',
                            'child' => [
                                '031101' => ['name' => '자전적에세이'],
                                '031103' => ['name' => '여러인물/인터뷰'],
                                '031105' => ['name' => '정치가/법조인'],
                                '031107' => ['name' => '기업가'],
                                '031109' => ['name' => '언론인'],
                                '031111' => ['name' => '문인/작가'],
                                '031113' => ['name' => '예술가'],
                                '031115' => ['name' => '과학자'],
                                '031117' => ['name' => '의료인'],
                                '031119' => ['name' => '철학가/사상가'],
                                '031121' => ['name' => '종교인'],
                                '031123' => ['name' => '역사인물'],
                                '031125' => ['name' => '사회운동가'],
                                '031129' => ['name' => '운동선수/무도인'],
                                '031131' => ['name' => '대중연예인'],
                            ]
                        ],
                        '0317' => [
                            'name' => '청소년에세이',
                            'child' => [
                                '031701' => ['name' => '청소년 시'],
                                '031703' => ['name' => '청소년 에세이'],
                            ]
                        ],
                        '0319' => [
                            'name' => '시/에세이문고',
                            'child' => [
                                '031901' => ['name' => '시/에세이문고 일반'],
                                '031903' => ['name' => '에버그린문고'],
                                '031921' => ['name' => '연하도서/카드도서'],
                            ]
                        ],
                    ]
                ],
            ]
        ],
    ],
];
